app/Controllers/Home.php

    public function universities()
    {
        $uniModel = new UniversityModel();
        $uniData  = $uniModel->findAll(8);
---
SELECT *
FROM `universities`
 LIMIT 8